interface TtotiInfo {
	title: string;
	subtitle: string;
	steps: string[];
}

const ttotiInfo: TtotiInfo[] = [
	{
		title: '또띠란?',
		subtitle: '나만의 마니또, 나만의 마니띠 ‘또띠’ 서비스를 소개합니다!',
		steps: [
			'비밀친구라는 뜻을 담고 있는 마니또',
			'어렸을 적 한번쯤은 해보지 않으셨나요?',
			'또띠의 다양한 서비스를 통해 그때의 기억 그대로, 마니또 게임을 함께 해보세요!',
		],
	},
	{
		title: '어떻게 시작하나요?',
		subtitle: '방을 만들고 초대코드를 공유해 친구들을 초대해보세요.',
		steps: [
			'친구에게 받은 초대코드를 통해 마니또 게임방에 입장하세요.',
			'내가 마니또인 걸 들키지 않게 도와줄 동물을 선택해 레디해 주세요!',
			'모든 사람이 레디를 하면 자동으로 게임이 시작되고 랜덤으로 마니또가 매칭됩니다!',
		],
	},
	{
		title: '또띠에서 할 수 있는 일들!',
		subtitle: '매일 제공되는 또띠 퀴즈 서비스!',
		steps: [
			'매일 주어지는 퀴즈에 대한 내 마니띠의 답을 예상해보세요.',
			'게임이 끝날 무렵엔 서로를 더 잘 알게 되어 있을 거예요!',
			'다음날이 되면 또띠 친구들과 서로의 마음을 맞혔는지 확인할 수 있어요.',
		],
	},
	{
		title: '또띠에서 할 수 있는 일들!',
		subtitle: '익명성 보장! 귀여운 또띠 채팅 서비스',
		steps: [
			'마니또의 메시지는 자신이 선택한 동물 말투로 변형되어 전달됩니다.',
			'자신의 정체를 숨긴 채 마니띠와 신비롭고 재미있게 소통해보세요!',
		],
	},
	{
		title: 'Coming Soon..',
		subtitle: '다양한 또띠 서비스! 기대해주세요!',
		steps: [
			'마니또 활동의 동기부여를 더해줄 온도 시스템을 개발중입니다!',
			'내 마니또가 누구일지, 추측하는 이벤트를 준비중입니다!',
			'게임이 종료되면 함께한 추억들을 되돌아볼 수 있는 또디 크레딧을 준비중입니다!',
		],
	},
];

export default ttotiInfo;
